Repository: pradoprojects/Translation_QA_Projects
Catalog: Translations/MegamanIntro.xlf
Languages: pt_br

# tu1
source: I strongly believe...<\r><\n>Albert's research must stop.
pt_br: Acredito firmemente...<\r><\n> A pesquisa de Albert deve parar.

# tu3
source: We can't build the future on your<\r><\n>empty optimism!
pt_br: No podemos construir o futuro com o seu<\r><\n> otimismo vazio!

# tu4
source: Say what you will, I cannot agree to this.
pt_br: Diga o que quiser, no posso concordar com isso.

# tu5
source: Please listen...
pt_br: Por favor, escute...

# tu6
source: No, you listen to this!
pt_br: No, escuta voc!

# tu7
source: At every turn, you've ignorantly<\r><\n>blocked my research...
pt_br: Voc sempre bloqueia minhas pesquisas<\r><\n>ignorantemente...

# tu8
source: Mr. Wily, control yourself.
pt_br: Sr. Wily, controle-se.

# tu9
source: I see the committee is in agreement.
pt_br: Vejo que o comit est de acordo.

# tu10
source: And so... the department chooses Thomas Light's<\r><\n>research into robots with independent thought.
pt_br: E assim... o departamento escolhe a pesquisa de Thomas Light <\r><\n> sobre robs com pensamento independente.

# tu11
source: Why...?<\r><\n>Why are you fools so blind!?
pt_br: Por qu?<\r><\n>Por que vocs so to cegos!?

# tu12
source: Ungh...<\r><\n>Bad memories make the worst dreams...
pt_br: Ungh...<\r><\n> Memrias ruins criam os piores sonhos...

# tu13
source: A genius of my caliber needs sleep to <\r><\n>keep his brain in gear.
pt_br: Um gnio do meu calibre precisa dormir para <\r><\n>manter seu crebro funcionando.

# tu14
source: Wait...
pt_br: Espere

# tu15
source: That research from my youth!
pt_br: Aquela pesquisa da minha juventude!

# tu16
source: Yes...<\r><\n>Now I'll show you, Light!
pt_br: Sim...<\r><\n>Agora eu vou te mostrar, Light!

# tu17
source: One day, Light!
pt_br: Um dia, Light!

# tu18
source: One day the world will know... I was right all along!
pt_br: Um dia o mundo saber... Eu estava certo o tempo todo!
